#DESENVOLVID POR: GUSTAVO BASÍLIO LIMA

In [ ]:
%load_ext autotime

time: 0 ns

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import plotly.graph_objs as go
import plotly.offline as py
import pymysql
from sqlalchemy import create_engine
from numpy import linalg as LA
from datetime import datetime
from scipy.spatial import distance

time: 3min 21s

In [ ]:
#Cálculo das latitudes e longitudes através da média aritmética
lat_lon = pd.DataFrame(columns = ['Cidade', 'Latitude', 'Longitude'])

lat_lon['Cidade']    = ['Itaporanga', 'São Gonçalo', 'Patos']
lat_lon['Latitude']  = [-7.3186111, -6.75666666, -7.07972221]
lat_lon['Longitude'] = [-38.14083333, -38.22749999, -37.27249999]

lat_lon.loc[3] = lat_lon.mean()

lat_lon['Cidade'][3] = 'Média'

lat_lon

C:\Users\Gustavo\anaconda3\lib\site-packages\ipykernel_launcher.py:10: SettingWithCopyWarning:


A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

        Cidade  Latitude  Longitude
0   Itaporanga -7.318611 -38.140833
1  São Gonçalo -6.756667 -38.227500
2        Patos -7.079722 -37.272500
3        Média -7.051667 -37.880278

time: 1.61 s

In [ ]:
#Criação de um dataframe que mostre as latitudes e longitudes das estações de cada cidade e da UFV
lat_lon = pd.DataFrame(columns = ['Cidade', 'Latitude', 'Longitude'])

lat_lon['Cidade']    = ['Itaporanga', 'São Gonçalo', 'Patos', 'Complexo']
lat_lon['Latitude']  = [-7.3186111, -6.75666666, -7.07972221, -6.963257]
lat_lon['Longitude'] = [-38.14083333, -38.22749999, -37.27249999, -37.999128]

lat_lon

        Cidade  Latitude  Longitude
0   Itaporanga -7.318611 -38.140833
1  São Gonçalo -6.756667 -38.227500
2        Patos -7.079722 -37.272500
3     Complexo -6.963257 -37.999128

time: 31 ms

In [ ]:
#Criação de um dataframe que represente o centróide da cidade de Coremas e as coordenadas calculadas
lat_lon_coremas = pd.DataFrame(columns = ['Coremas', 'Latitude', 'Longitude'])

lat_lon_coremas['Coremas']   = ['Medido', 'Calculado - Média']
lat_lon_coremas['Latitude']  = [-7.01439, -7.051667]
lat_lon_coremas['Longitude'] = [-37.94579, -37.880278]

lat_lon_coremas

             Coremas  Latitude  Longitude
0             Medido -7.014390 -37.945790
1  Calculado - Média -7.051667 -37.880278

time: 31 ms

In [ ]:
#Latitudes e longitudes das estações das cidades, além do local retirado da NASA,
#além da média aritmética calculada e da localização da UFV
itaporanga_gps      = (-7.318611, -38.140833)
sao_goncalo_gps     = (-6.756667, -38.227500)
patos_gps           = (-7.079722, -37.272500)
coremas_centroide   = (-7.014390, -37.945790)
coremas_media_aritm = (-7.051667, -37.880278)
coremas_complexo    = (-6.963257, -37.999128)

time: 0 ns

Representação do sistema que deve ser solucionado:

-6.963257  = x * -7.318611  + y * -6.756667  + z * -7.079722

-37.999128 = x * -38.140833 + y * -38.227500 + z * -37.2725

1     = x              + y              + z

In [ ]:
#Para a solução do sistema se é utilizado a regra de Cramer, isso vem pelo fato de querermos saber
#os ponderamentos pelo inverso da distância (IDW)

A = np.array([[ -7.318611,  -6.756667,  -7.079722],
             [-38.140833, -38.227500, -37.272500],
             [1,                1,             1]])

Ax = np.array([[ -6.963257,  -6.756667,  -7.079722],
              [-37.999128, -38.227500, -37.272500],
              [1,                1,             1]])

Ay = np.array([[ -7.318611, -6.963257,  -7.079722],
              [-38.140833, -37.999128, -37.272500],
              [1,                1,             1]])

Az = np.array([[ -7.318611,  -6.756667,  -6.963257],
              [-38.140833, -38.227500, -37.999128],
              [1,                1,             1]])

x = LA.det(Ax)/LA.det(A)
y = LA.det(Ay)/LA.det(A)
z = LA.det(Az)/LA.det(A)

print(x, y, z)

0.24282849714546484 0.5400753953803009 0.21709610747423555
time: 1.58 s

Os próximos 2 blocos de códigos são para checar as latitudes e longitudes calculadas para a UFV batem os resultados

In [ ]:
np.average([-7.318611, -6.756667, -7.079722], weights = [x, y, z])

-6.9632570000000005

time: 16 ms

In [ ]:
np.average([-38.140833, -38.227500, -37.272500], weights = [x, y, z])

-37.999128

time: 16 ms

In [ ]:
#Determinação do peso da interferência da estação de Itaporanga em Coremas 
p_ci = x
p_ci

0.24282849714546484

time: 31 ms

In [ ]:
#Determinação do peso da interferência da estação de São Gonçalo em Coremas
p_csg = y
p_csg

0.5400753953803009

time: 15 ms

In [ ]:
#Determinação do peso da interferência da estação de Patos em Coremas
p_cp = z
p_cp

0.21709610747423555

time: 16 ms

Os próximos 2 blocos de códigos são para podermos visualizar a precisão entre quando calculamos as coordenadas através da média ponderada e da média airtmética

In [ ]:
distance.euclidean(coremas_complexo, [-6.9632570000000005, -37.999128])

8.881784197001252e-16

time: 250 ms

In [ ]:
distance.euclidean(coremas_complexo, coremas_media_aritm)

0.14812714336002214

time: 16 ms

In [ ]:
#Importação dos dados das estações
patos      = pd.read_csv('/Patos(2007 - 2020).csv')
saogoncalo = pd.read_csv('/São Gonçalo(2007 - 2020).csv')
itaporanga = pd.read_csv('/Itaporanga(2017 - 2020).csv')

time: 3.2 s

In [ ]:
#Criação de uma função para deixar os dataframes relacionados as propriedades retiradas
#da estação automática de Itaporanga do mesmo tamanho dos dataframes relacionados as
#propriedades retiradas da estação automática de Patos

def comp_it (nomecoluna,
             cidadecoluna):
    '''
    Completar com NaN os dados ausentes de Itaporanga para se enquadrar no tamanho do DF de Patos
    '''
    
    #Criação de dados NaN para completar as datas entre o início de operação 
    #da estação de Patos até o início de operação da estação de Itaporanga
    To_Complete_Before = pd.DataFrame(index = range(0, 90936), columns = nomecoluna)
    
    #Criação de dados NaN para completar completar até a data da última medição
    #já que a última medição de Itaporanga foi bem antes (em meados de Abril) da de Patos
    To_Complete_After = pd.DataFrame(index = range(0, 1954), columns = nomecoluna)
    
    #Transformando a coluna de um dataframe em um dataframe
    cidadecoluna = pd.DataFrame(cidadecoluna)
    
    #Pré-processo para a concatenação de dataframes
    Completar = [To_Complete_Before , cidadecoluna, To_Complete_After]
    
    #Concatenação do dataframe
    Completo = pd.concat(Completar, ignore_index = 'False')
        
    return Completo

time: 0 ns

In [ ]:
#Criação de uma função para deixar os dataframes relacionados as propriedades retiradas
#da estação automática de São Gonçalo do mesmo tamanho dos dataframes relacionados as
#propriedades retiradas da estação automática de Patos

def comp_sg(nomecoluna,
            cidadecoluna):
    
    '''
    Completar com NaN os dados ausentes de Itaporanga para se enquadrar no tamanho do DF de Patos
    '''
    
    
    #Criação de dados NaN para completar as datas entre o início de operação 
    #da estação de Patos até o início de operação da estação de São Gonçalo
    #já que a última medição de ambas as estação foram no mesmo dia e na mesmo hora

    To_Complete = pd.DataFrame(index = range(0, 2592), columns = nomecoluna)

    #Transformando a coluna de um dataframe em um dataframe
    cidadecoluna = pd.DataFrame(cidadecoluna)


    #Pré-processo para a concatenação de dataframes
    Completar = [To_Complete, cidadecoluna]

    #Concatenação do dataframe
    Completo = pd.concat(Completar, ignore_index = 'False')

    return Completo

time: 0 ns

In [ ]:
#Criação de uma função pra deixar um dataframe único com as propriedades obtidas de cada
#estação automática e sua média

def df_prop(df,                     #Nome do DATAFRAME a ser criado
            nomecolunaoriginal,     #Nome da coluna da propriedade de acordo com o INMET
            prop_sg,                #Nome do DATAFRAME já criado para a propriedade em SÃO GONÇALO
            prop_ita):              #Nome do DATAFRAME já criado para a propriedade em ITAPORANGA
    
    '''
    Adicionando colunas em um dataframe
    '''
    
    #Criação de uma lista vazia
    df = []
    
    #Transformação dessa lista vazia em um dataframe vazio
    df = pd.DataFrame(df)
    
    #Adição das colunas no dataframe
    df['DATA'] = patos['DATA']
    df['PATOS'] = patos[nomecolunaoriginal]
    df['SAO GONCALO'] = prop_sg[nomecolunaoriginal]
    df['ITAPORANGA'] = prop_ita[nomecolunaoriginal]

    propriedade = pd.DataFrame(df)
    
    return propriedade

time: 16 ms

In [ ]:
#Criação de uma função para fornecer um dataframe completo com a propriedade desejada

def df_prop_completo (nomedf,
                      nomecoluna):
    
    '''
    Criação do dataframe completo da propriedade desejada
    '''
    
    
    #Criação do dataframe com alguma propriedade 
    #na estação automática de São Gonçalo

    df_prop_sg = comp_sg([nomecoluna], 
                         saogoncalo[nomecoluna])

    #Criação do dataframe com alguma propriedade
    #na estação automática de Itaporanga

    df_prop_it = comp_it([nomecoluna],
                         itaporanga[nomecoluna])

    #Criação do dataframe da propriedade

    nomedf = df_prop(nomedf, 
                     nomecoluna, 
                     df_prop_sg, 
                     df_prop_it)
    
    return nomedf

time: 0 ns

In [ ]:
#Tornando o dataframe da variável RADIAÇÃO GLOBAL de São Gonçalo do mesmo tamanho de Coremas
rad_glo_sg = comp_sg(['RADIACAO GLOBAL (kJ/m²)'], saogoncalo['RADIACAO GLOBAL (kJ/m²)'])
rad_glo_sg

        RADIACAO GLOBAL (kJ/m²)
0                           NaN
1                           NaN
2                           NaN
3                           NaN
4                           NaN
...                         ...
114235                   1705.0
114236                    839.0
114237                    123.4
114238                      NaN
114239                      NaN

[114240 rows x 1 columns]

time: 16 ms

In [ ]:
#Tornando o dataframe da variável RADIAÇÃO GLOBAL de Itaporanga do mesmo tamanho de Coremas
rad_glo_it = comp_it(['RADIACAO GLOBAL (kJ/m²)'], itaporanga['RADIACAO GLOBAL (kJ/m²)'])
rad_glo_it

        RADIACAO GLOBAL (kJ/m²)
0                           NaN
1                           NaN
2                           NaN
3                           NaN
4                           NaN
...                         ...
114235                      NaN
114236                      NaN
114237                      NaN
114238                      NaN
114239                      NaN

[114240 rows x 1 columns]

time: 47 ms

In [ ]:
#Criação de um dataframe com as medições da RADIAÇÃO GLOBAL em todas as estações
rad_glo = []
rad_glo = df_prop(rad_glo, 'RADIACAO GLOBAL (kJ/m²)', rad_glo_sg, rad_glo_it)
rad_glo = rad_glo.replace([-9999.0], np.NaN)
rad_glo = rad_glo.replace([0], [np.nan])
rad_glo

                       DATA   PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00     NaN          NaN         NaN
1       2007-07-21 01:00:00     NaN          NaN         NaN
2       2007-07-21 02:00:00     NaN          NaN         NaN
3       2007-07-21 03:00:00     NaN          NaN         NaN
4       2007-07-21 04:00:00     NaN          NaN         NaN
...                     ...     ...          ...         ...
114235  2020-07-31 19:00:00  1107.1       1705.0         NaN
114236  2020-07-31 20:00:00   706.3        839.0         NaN
114237  2020-07-31 21:00:00    45.9        123.4         NaN
114238  2020-07-31 22:00:00     NaN          NaN         NaN
114239  2020-07-31 23:00:00     NaN          NaN         NaN

[114240 rows x 4 columns]

time: 313 ms

Representação das possibilidades de como os dados estarão no dataframe:

>- nan, nan, nan;

>- nan, nan,  1 ;

>- nan,  1 , nan;

>- 1 , nan, nan;

>- nan,  1 ,  1 ;

>- 1 ,  1 , nan;

>- 1 , nan,  1 ;

>- 1 ,  1 ,  1 .

In [ ]:
def prop_pond(nome_df, nome_coluna):
    media_pond = {}
    media_pond = pd.DataFrame(media_pond)

    for i in range(0, int(len(nome_df)), 1):
        if (pd.isna(nome_df['PATOS'].loc[i])           == True 
            and pd.isna(nome_df['SAO GONCALO'].loc[i]) == True
            and pd.isna(nome_df['ITAPORANGA'].loc[i])  == True):
        
             media_pond = media_pond.append(pd.DataFrame([np.nan]))
            
        elif (pd.isna(nome_df['PATOS'].loc[i])           == True 
              and pd.isna(nome_df['SAO GONCALO'].loc[i]) == True
              and pd.isna(nome_df['ITAPORANGA'].loc[i])  == False):
        
            media_pond = media_pond.append(pd.DataFrame([np.average([float(nome_df['ITAPORANGA'].loc[i])],
                                                                     weights = [p_ci/p_ci])]))
    
        elif (pd.isna(nome_df['PATOS'].loc[i])           == True 
              and pd.isna(nome_df['SAO GONCALO'].loc[i]) == False
              and pd.isna(nome_df['ITAPORANGA'].loc[i])  == True):
        
            media_pond = media_pond.append(pd.DataFrame([np.average([float(nome_df['SAO GONCALO'].loc[i]),                                        ],
                                                                     weights = [p_csg/p_csg])]))
    
        elif (pd.isna(nome_df['PATOS'].loc[i])           == False 
              and pd.isna(nome_df['SAO GONCALO'].loc[i]) == True
              and pd.isna(nome_df['ITAPORANGA'].loc[i])  == True):
        
            media_pond = media_pond.append(pd.DataFrame([np.average([float(nome_df['PATOS'].loc[i])],
                                                                     weights = [p_cp])]))
    
        elif (pd.isna(nome_df['PATOS'].loc[i])           == True 
              and pd.isna(nome_df['SAO GONCALO'].loc[i]) == False
              and pd.isna(nome_df['ITAPORANGA'].loc[i])  == False):
        
            media_pond = media_pond.append(pd.DataFrame([np.average([float(nome_df['SAO GONCALO'].loc[i]),
                                                                     float(nome_df['ITAPORANGA'].loc[i])],
                                                                     weights = [p_csg/(p_csg + p_ci),
                                                                                p_ci/(p_csg + p_ci)])]))
    
        elif (pd.isna(nome_df['PATOS'].loc[i])           == False 
              and pd.isna(nome_df['SAO GONCALO'].loc[i]) == False
              and pd.isna(nome_df['ITAPORANGA'].loc[i])  == True):
        
            media_pond = media_pond.append(pd.DataFrame([np.average([float(nome_df['PATOS'].loc[i]),
                                                                     float(nome_df['SAO GONCALO'].loc[i])],
                                                                     weights = [p_cp/(p_cp + p_csg),
                                                                                p_csg/(p_cp + p_csg)])]))
    
        elif (pd.isna(nome_df['PATOS'].loc[i])           == False 
              and pd.isna(nome_df['SAO GONCALO'].loc[i]) == True
              and pd.isna(nome_df['PATOS'].loc[i])       == False):
        
            media_pond = media_pond.append(pd.DataFrame([np.average([float(nome_df['PATOS'].loc[i]),
                                                                     float(nome_df['ITAPORANGA'].loc[i])],
                                                                     weights = [p_cp/(p_cp + p_ci),
                                                                                p_ci/(p_cp + p_ci)])]))
    
        else:
            media_pond = media_pond.append(pd.DataFrame([np.average([float(nome_df['PATOS'].loc[i]),
                                                                     float(nome_df['SAO GONCALO'].loc[i]),
                                                                     float(nome_df['ITAPORANGA'].loc[i])],
                                                                     weights = [p_cp,
                                                                                p_csg,
                                                                                p_ci])]))
        
    media_pond = media_pond.reset_index(drop = True)
    media_pond = pd.DataFrame(media_pond)
    media_pond.rename(columns={0: nome_coluna}, inplace = True)
        
    return media_pond

time: 16 ms

In [ ]:
#Criação do dataframe da propriedade 'RADIACAO GLOBAL (kJ/m²)'

rad_glo_media_pond = []

rad_glo_media_pond = pd.DataFrame(df_prop_completo(rad_glo, 'RADIACAO GLOBAL (kJ/m²)'))

rad_glo_media_pond

                       DATA   PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00 -9999.0          NaN         NaN
1       2007-07-21 01:00:00 -9999.0          NaN         NaN
2       2007-07-21 02:00:00 -9999.0          NaN         NaN
3       2007-07-21 03:00:00 -9999.0          NaN         NaN
4       2007-07-21 04:00:00 -9999.0          NaN         NaN
...                     ...     ...          ...         ...
114235  2020-07-31 19:00:00  1107.1       1705.0         NaN
114236  2020-07-31 20:00:00   706.3        839.0         NaN
114237  2020-07-31 21:00:00    45.9        123.4         NaN
114238  2020-07-31 22:00:00     0.0          NaN         NaN
114239  2020-07-31 23:00:00     0.0          NaN         NaN

[114240 rows x 4 columns]

time: 78 ms

In [ ]:
rad_glo_media_pond = prop_pond(rad_glo, 'rad_glo')
rad_glo_media_pond

            rad_glo
0               NaN
1               NaN
2               NaN
3               NaN
4               NaN
...             ...
114235  1533.570196
114236   800.952275
114237   101.179211
114238          NaN
114239          NaN

[114240 rows x 1 columns]

time: 2min 41s

In [ ]:
contador = rad_glo_media_pond['rad_glo'].isna().sum()
contador

52169

In [ ]:
#Repartindo o dataframe para que posteriormente possamos fazer a interpolação dos dados faltantes
media_pond_interp = rad_glo_media_pond.iloc[9 : 114238].reset_index(drop = True)
media_pond_interp = pd.DataFrame(media_pond_interp)
media_pond_interp

            rad_glo
0          6.300000
1        434.600000
2       1250.000000
3       2032.500000
4       2637.000000
...             ...
114224  2236.696806
114225  2008.569586
114226  1533.570196
114227   800.952275
114228   101.179211

[114229 rows x 1 columns]

In [ ]:
#Esse bloco de código foi feito para que a interpolação seja feita apenas nos horários que de fato
#deverão ter alguma mediçaõ (entre 6hrs e 18hrs), além da colocação de NaN nos outros horários
media_pond_corr = {}
media_pond_corr = pd.DataFrame(media_pond_corr, columns = ['rad_glo'])
for i in range(0, 4760, 1):
    media_pond_corr = media_pond_corr.append([pd.DataFrame(media_pond_interp['rad_glo'].iloc[i * 24 : ((i + 1) * 24) - 11].interpolate(limit_direction = 'both', limit_area = 'inside'))])
    media_pond_corr = media_pond_corr.append([pd.DataFrame(media_pond_interp['rad_glo'].iloc[((i + 1) * 24) - 11 : (i + 1) * 24].replace(list(media_pond_interp['rad_glo'].iloc[((i + 1) * 24) - 11 : (i + 1) * 24]), np.nan ))])

media_pond_corr

            rad_glo
0          6.300000
1        434.600000
2       1250.000000
3       2032.500000
4       2637.000000
...             ...
114224  2236.696806
114225  2008.569586
114226  1533.570196
114227   800.952275
114228   101.179211

[114229 rows x 1 columns]

In [ ]:
#Complemento para ser colocado no início do dataframe já interpolado
media_pond_corr_before = {}
media_pond_corr_before = pd.DataFrame()
media_pond_corr_before['rad_glo'] = rad_glo_media_pond['rad_glo'].iloc[ : 9]
media_pond_corr_before

   rad_glo
0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
8      NaN

In [ ]:
#Complemento para ser colocado no fim do dataframe já interpolado
media_pond_corr_after = {}
media_pond_corr_after = pd.DataFrame()
media_pond_corr_after['rad_glo'] = rad_glo_media_pond['rad_glo'].iloc[114238 : ]
media_pond_corr_after

        rad_glo
114238      NaN
114239      NaN

In [ ]:
#Recolocação para ter o dataframe do mesmo tamanho que antes do processo ser realizado
rad_glo_media_pond_corr_final = {}
rad_glo_media_pond_corr_final = pd.DataFrame(rad_glo_media_pond_corr_final)
rad_glo_media_pond_corr_final = media_pond_corr_before.append([media_pond_corr, media_pond_corr_after]).reset_index(drop = True)
rad_glo_media_pond_corr_final

            rad_glo
0               NaN
1               NaN
2               NaN
3               NaN
4               NaN
...             ...
114235  1533.570196
114236   800.952275
114237   101.179211
114238          NaN
114239          NaN

[114240 rows x 1 columns]

In [ ]:
contador = rad_glo_media_pond_corr_final['rad_glo'].isna().sum()
contador

52846

In [ ]:
#Criação do dataframe da propriedade PRECIPITAÇÃO TOTAL, HORÁRIO (mm)

precip_tot = []

precip_tot = pd.DataFrame(df_prop_completo(precip_tot ,'PRECIPITAÇÃO TOTAL, HORÁRIO (mm)'))

precip_tot = precip_tot.replace([-9999], [np.nan])

precip_tot

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00    0.0          NaN         NaN
1       2007-07-21 01:00:00    0.0          NaN         NaN
2       2007-07-21 02:00:00    0.0          NaN         NaN
3       2007-07-21 03:00:00    0.0          NaN         NaN
4       2007-07-21 04:00:00    0.0          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00    0.0          0.0         NaN
114236  2020-07-31 20:00:00    0.0          0.0         NaN
114237  2020-07-31 21:00:00    0.0          0.0         NaN
114238  2020-07-31 22:00:00    0.0          0.0         NaN
114239  2020-07-31 23:00:00    0.0          0.0         NaN

[114240 rows x 4 columns]

In [ ]:
precip_tot_media_pond = prop_pond(precip_tot, 'precip_tot')
precip_tot_media_pond

        precip_tot
0              0.0
1              0.0
2              0.0
3              0.0
4              0.0
...            ...
114235         0.0
114236         0.0
114237         0.0
114238         0.0
114239         0.0

[114240 rows x 1 columns]

In [ ]:
contador = precip_tot_media_pond['precip_tot'].isna().sum()
contador

1123

In [ ]:
#Criação do dataframe da propriedade PRESSAO ATMOSFERICA AO NIVEL DA ESTACAO, HORARIA (mB)

pres_atm_niv_est = []

pres_atm_niv_est = df_prop_completo(pres_atm_niv_est, 
                                    'PRESSAO ATMOSFERICA AO NIVEL DA ESTACAO, HORARIA (mB)')

pres_atm_niv_est = pres_atm_niv_est.replace([0], [np.nan])

pres_atm_niv_est = pres_atm_niv_est.replace([-9999], [np.nan])

pres_atm_niv_est

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00  985.1          NaN         NaN
1       2007-07-21 01:00:00  985.4          NaN         NaN
2       2007-07-21 02:00:00  985.6          NaN         NaN
3       2007-07-21 03:00:00  985.6          NaN         NaN
4       2007-07-21 04:00:00  985.4          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00  983.7        986.5         NaN
114236  2020-07-31 20:00:00  983.9        986.7         NaN
114237  2020-07-31 21:00:00  984.5        987.2         NaN
114238  2020-07-31 22:00:00  985.3        987.8         NaN
114239  2020-07-31 23:00:00  986.2        988.4         NaN

[114240 rows x 4 columns]

In [ ]:
pres_atm_niv_est_media_pond = prop_pond(pres_atm_niv_est, 'pres_atm_niv_est')
pres_atm_niv_est_media_pond

        pres_atm_niv_est
0             985.100000
1             985.400000
2             985.600000
3             985.600000
4             985.400000
...                  ...
114235        985.697184
114236        985.897184
114237        986.425856
114238        987.083200
114239        987.769216

[114240 rows x 1 columns]

In [ ]:
contador = pres_atm_niv_est_media_pond['pres_atm_niv_est'].isna().sum()
contador

1122

In [ ]:
#Criação do dataframe da propriedade PRESSÃO ATMOSFERICA MAX.NA HORA ANT. (AUT) (mB)

pres_atm_max_hr_ant = []

pres_atm_max_hr_ant = df_prop_completo(pres_atm_max_hr_ant, 
                                       'PRESSÃO ATMOSFERICA MAX.NA HORA ANT. (AUT) (mB)')

pres_atm_max_hr_ant = pres_atm_max_hr_ant.replace([0], [np.nan])

pres_atm_max_hr_ant = pres_atm_max_hr_ant.replace([-9999], [np.nan])

pres_atm_max_hr_ant

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00  985.1          NaN         NaN
1       2007-07-21 01:00:00  985.4          NaN         NaN
2       2007-07-21 02:00:00  985.7          NaN         NaN
3       2007-07-21 03:00:00  985.8          NaN         NaN
4       2007-07-21 04:00:00  985.7          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00  983.8        986.6         NaN
114236  2020-07-31 20:00:00  983.9        986.7         NaN
114237  2020-07-31 21:00:00  984.5        987.2         NaN
114238  2020-07-31 22:00:00  985.3        987.8         NaN
114239  2020-07-31 23:00:00  986.2        988.4         NaN

[114240 rows x 4 columns]

In [ ]:
pres_atm_max_hr_ant_media_pond = prop_pond(pres_atm_max_hr_ant, 'pres_atm_max_hr_ant')
pres_atm_max_hr_ant_media_pond

        pres_atm_max_hr_ant
0                985.100000
1                985.400000
2                985.700000
3                985.800000
4                985.700000
...                     ...
114235           985.797184
114236           985.897184
114237           986.425856
114238           987.083200
114239           987.769216

[114240 rows x 1 columns]

In [ ]:
contador = pres_atm_max_hr_ant_media_pond['pres_atm_max_hr_ant'].isna().sum()
contador

1134

In [ ]:
#Criação do dataframe da propriedade PRESSÃO ATMOSFERICA MIN. NA HORA ANT. (AUT) (mB)

pres_atm_min_hr_ant = []

pres_atm_min_hr_ant = df_prop_completo(pres_atm_min_hr_ant, 
                                       'PRESSÃO ATMOSFERICA MIN. NA HORA ANT. (AUT) (mB)')

pres_atm_min_hr_ant = pres_atm_min_hr_ant.replace([0], [np.nan])

pres_atm_min_hr_ant = pres_atm_min_hr_ant.replace([-9999], [np.nan])

pres_atm_min_hr_ant

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00  984.6          NaN         NaN
1       2007-07-21 01:00:00  985.0          NaN         NaN
2       2007-07-21 02:00:00  985.4          NaN         NaN
3       2007-07-21 03:00:00  985.6          NaN         NaN
4       2007-07-21 04:00:00  985.3          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00  983.5        986.5         NaN
114236  2020-07-31 20:00:00  983.7        986.5         NaN
114237  2020-07-31 21:00:00  983.9        986.7         NaN
114238  2020-07-31 22:00:00  984.5        987.2         NaN
114239  2020-07-31 23:00:00  985.3        987.8         NaN

[114240 rows x 4 columns]

In [ ]:
pres_atm_min_hr_ant_media_pond = prop_pond(pres_atm_min_hr_ant, 'pres_atm_min_hr_ant')
pres_atm_min_hr_ant_media_pond

        pres_atm_min_hr_ant
0                984.600000
1                985.000000
2                985.400000
3                985.600000
4                985.300000
...                     ...
114235           985.639840
114236           985.697184
114237           985.897184
114238           986.425856
114239           987.083200

[114240 rows x 1 columns]

In [ ]:
contador = pres_atm_min_hr_ant_media_pond['pres_atm_min_hr_ant'].isna().sum()
contador

1134

In [ ]:
#Criação do dataframe da propriedade TEMPERATURA DO AR - BULBO SECO, HORARIA (°C)

temp_bulbo_seco = []

temp_bulbo_seco = df_prop_completo(temp_bulbo_seco, 
                                   'TEMPERATURA DO AR - BULBO SECO, HORARIA (°C)')

temp_bulbo_seco = temp_bulbo_seco.replace([0], [np.nan])

temp_bulbo_seco = temp_bulbo_seco.replace([-9999], [np.nan])

temp_bulbo_seco

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00   25.0          NaN         NaN
1       2007-07-21 01:00:00   24.6          NaN         NaN
2       2007-07-21 02:00:00   24.3          NaN         NaN
3       2007-07-21 03:00:00   23.6          NaN         NaN
4       2007-07-21 04:00:00   22.9          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00   31.2         30.7         NaN
114236  2020-07-31 20:00:00   30.8         30.1         NaN
114237  2020-07-31 21:00:00   27.9         28.7         NaN
114238  2020-07-31 22:00:00   27.5         25.4         NaN
114239  2020-07-31 23:00:00   26.9         25.3         NaN

[114240 rows x 4 columns]

In [ ]:
temp_bulbo_seco_media_pond = prop_pond(temp_bulbo_seco, 'temp_bulbo_seco')
temp_bulbo_seco_media_pond

        temp_bulbo_seco
0             25.000000
1             24.600000
2             24.300000
3             23.600000
4             22.900000
...                 ...
114235        30.843360
114236        30.300704
114237        28.470624
114238        26.002112
114239        25.758752

[114240 rows x 1 columns]

In [ ]:
contador = temp_bulbo_seco_media_pond['temp_bulbo_seco'].isna().sum()
contador

1122

In [ ]:
#Criação do dataframe da propriedade TEMPERATURA DO PONTO DE ORVALHO (°C)

temp_p_orv = []

temp_p_orv = df_prop_completo(temp_p_orv, 
                              'TEMPERATURA DO PONTO DE ORVALHO (°C)')

temp_p_orv = temp_p_orv.replace([-9999], [np.nan])

temp_p_orv

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00   16.2          NaN         NaN
1       2007-07-21 01:00:00   15.5          NaN         NaN
2       2007-07-21 02:00:00   14.7          NaN         NaN
3       2007-07-21 03:00:00   15.2          NaN         NaN
4       2007-07-21 04:00:00   15.3          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00   15.4         13.7         NaN
114236  2020-07-31 20:00:00   15.2         14.6         NaN
114237  2020-07-31 21:00:00   15.8         14.8         NaN
114238  2020-07-31 22:00:00   15.4         15.6         NaN
114239  2020-07-31 23:00:00   16.3         16.2         NaN

[114240 rows x 4 columns]

In [ ]:
temp_p_orv_media_pond = prop_pond(temp_p_orv, 'temp_p_orv')
temp_p_orv_media_pond

        temp_p_orv
0        16.200000
1        15.500000
2        14.700000
3        15.200000
4        15.300000
...            ...
114235   14.187424
114236   14.772032
114237   15.086720
114238   15.542656
114239   16.228672

[114240 rows x 1 columns]

In [ ]:
contador = temp_p_orv_media_pond['temp_p_orv'].isna().sum()
contador

1123

In [ ]:
#Criação do dataframe da propriedade TEMPERATURA MÁXIMA NA HORA ANT. (AUT) (°C)

temp_max_hr_ant = []

temp_max_hr_ant = df_prop_completo(temp_max_hr_ant, 
                                   'TEMPERATURA MÁXIMA NA HORA ANT. (AUT) (°C)')

temp_max_hr_ant = temp_max_hr_ant.replace([0], [np.nan])

temp_max_hr_ant = temp_max_hr_ant.replace([-9999], [np.nan])

temp_max_hr_ant

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00   26.6          NaN         NaN
1       2007-07-21 01:00:00   25.0          NaN         NaN
2       2007-07-21 02:00:00   24.6          NaN         NaN
3       2007-07-21 03:00:00   24.4          NaN         NaN
4       2007-07-21 04:00:00   23.6          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00   32.1         31.2         NaN
114236  2020-07-31 20:00:00   31.5         30.8         NaN
114237  2020-07-31 21:00:00   30.8         30.1         NaN
114238  2020-07-31 22:00:00   27.9         28.7         NaN
114239  2020-07-31 23:00:00   27.5         26.3         NaN

[114240 rows x 4 columns]

In [ ]:
temp_max_hr_ant_media_pond = prop_pond(temp_max_hr_ant, 'temp_max_hr_ant')
temp_max_hr_ant_media_pond

        temp_max_hr_ant
0             26.600000
1             25.000000
2             24.600000
3             24.400000
4             23.600000
...                 ...
114235        31.458048
114236        31.000704
114237        30.300704
114238        28.470624
114239        26.644064

[114240 rows x 1 columns]

In [ ]:
contador = temp_max_hr_ant_media_pond['temp_max_hr_ant'].isna().sum()
contador

1134

In [ ]:
#Criação do dataframe da propriedade TEMPERATURA MÍNIMA NA HORA ANT. (AUT) (°C)

temp_min_hr_ant = []

temp_min_hr_ant = df_prop_completo(temp_min_hr_ant, 
                                   'TEMPERATURA MÍNIMA NA HORA ANT. (AUT) (°C)')

temp_min_hr_ant = temp_min_hr_ant.replace([0], [np.nan])

temp_min_hr_ant = temp_min_hr_ant.replace([-9999], [np.nan])

temp_min_hr_ant

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00   25.0          NaN         NaN
1       2007-07-21 01:00:00   24.6          NaN         NaN
2       2007-07-21 02:00:00   24.3          NaN         NaN
3       2007-07-21 03:00:00   23.5          NaN         NaN
4       2007-07-21 04:00:00   22.9          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00   30.1         30.2         NaN
114236  2020-07-31 20:00:00   30.8         30.0         NaN
114237  2020-07-31 21:00:00   27.9         28.5         NaN
114238  2020-07-31 22:00:00   27.1         25.4         NaN
114239  2020-07-31 23:00:00   26.9         25.2         NaN

[114240 rows x 4 columns]

In [ ]:
temp_min_hr_ant_media_pond = prop_pond(temp_min_hr_ant, 'temp_min_hr_ant')
temp_min_hr_ant_media_pond

        temp_min_hr_ant
0             25.000000
1             24.600000
2             24.300000
3             23.500000
4             22.900000
...                 ...
114235        30.171328
114236        30.229376
114237        28.327968
114238        25.887424
114239        25.687424

[114240 rows x 1 columns]

In [ ]:
contador = temp_min_hr_ant_media_pond['temp_min_hr_ant'].isna().sum()
contador

1134

In [ ]:
#Criação do dataframe da propriedade TEMPERATURA ORVALHO MAX. NA HORA ANT. (AUT) (°C)

temp_p_orv_max_hr_ant = []

temp_p_orv_max_hr_ant = df_prop_completo(temp_p_orv_max_hr_ant, 
                                         'TEMPERATURA ORVALHO MAX. NA HORA ANT. (AUT) (°C)')

temp_p_orv_max_hr_ant = temp_p_orv_max_hr_ant.replace([-9999], [np.nan])

temp_p_orv_max_hr_ant

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00   17.3          NaN         NaN
1       2007-07-21 01:00:00   16.2          NaN         NaN
2       2007-07-21 02:00:00   15.5          NaN         NaN
3       2007-07-21 03:00:00   15.3          NaN         NaN
4       2007-07-21 04:00:00   15.4          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00   16.0         14.4         NaN
114236  2020-07-31 20:00:00   15.8         14.6         NaN
114237  2020-07-31 21:00:00   15.9         14.9         NaN
114238  2020-07-31 22:00:00   16.3         15.8         NaN
114239  2020-07-31 23:00:00   16.3         16.2         NaN

[114240 rows x 4 columns]

In [ ]:
temp_p_orv_max_hr_ant_media_pond = prop_pond(temp_p_orv_max_hr_ant, 'temp_p_orv_max_hr_ant')
temp_p_orv_max_hr_ant_media_pond

        temp_p_orv_max_hr_ant
0                   17.300000
1                   16.200000
2                   15.500000
3                   15.300000
4                   15.400000
...                       ...
114235              14.858752
114236              14.944064
114237              15.186720
114238              15.943360
114239              16.228672

[114240 rows x 1 columns]

In [ ]:
contador = temp_p_orv_max_hr_ant_media_pond['temp_p_orv_max_hr_ant'].isna().sum()
contador

1134

In [ ]:
#Criação do dataframe da propriedade TEMPERATURA ORVALHO MIN. NA HORA ANT. (AUT) (°C)

temp_p_orv_min_hr_ant = []

temp_p_orv_min_hr_ant = df_prop_completo(temp_p_orv_min_hr_ant, 
                                        'TEMPERATURA ORVALHO MIN. NA HORA ANT. (AUT) (°C)')

temp_p_orv_min_hr_ant = temp_p_orv_min_hr_ant.replace([-9999], [np.nan])

temp_p_orv_min_hr_ant

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00   16.2          NaN         NaN
1       2007-07-21 01:00:00   15.5          NaN         NaN
2       2007-07-21 02:00:00   14.7          NaN         NaN
3       2007-07-21 03:00:00   14.6          NaN         NaN
4       2007-07-21 04:00:00   15.2          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00   14.7         13.3         NaN
114236  2020-07-31 20:00:00   14.8         13.6         NaN
114237  2020-07-31 21:00:00   15.2         14.5         NaN
114238  2020-07-31 22:00:00   15.3         14.7         NaN
114239  2020-07-31 23:00:00   15.1         15.3         NaN

[114240 rows x 4 columns]

In [ ]:
temp_p_orv_min_hr_ant_media_pond = prop_pond(temp_p_orv_min_hr_ant, 'temp_p_orv_min_hr_ant')
temp_p_orv_min_hr_ant_media_pond

        temp_p_orv_min_hr_ant
0                   16.200000
1                   15.500000
2                   14.700000
3                   14.600000
4                   15.200000
...                       ...
114235              13.701408
114236              13.944064
114237              14.700704
114238              14.872032
114239              15.242656

[114240 rows x 1 columns]

In [ ]:
contador = temp_p_orv_min_hr_ant_media_pond['temp_p_orv_min_hr_ant'].isna().sum()
contador

1134

In [ ]:
#Criação do dataframe da propriedade UMIDADE REL. MAX. NA HORA ANT. (AUT) (%)

umi_rel_max_hr_ant = []

umi_rel_max_hr_ant = df_prop_completo(umi_rel_max_hr_ant, 
                                      'UMIDADE REL. MAX. NA HORA ANT. (AUT) (%)')

umi_rel_max_hr_ant = umi_rel_max_hr_ant.replace([-9999], [np.nan])

umi_rel_max_hr_ant

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00   59.0          NaN         NaN
1       2007-07-21 01:00:00   59.0          NaN         NaN
2       2007-07-21 02:00:00   57.0          NaN         NaN
3       2007-07-21 03:00:00   60.0          NaN         NaN
4       2007-07-21 04:00:00   63.0          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00   41.0         38.0         NaN
114236  2020-07-31 20:00:00   39.0         39.0         NaN
114237  2020-07-31 21:00:00   48.0         43.0         NaN
114238  2020-07-31 22:00:00   51.0         55.0         NaN
114239  2020-07-31 23:00:00   52.0         57.0         NaN

[114240 rows x 4 columns]

In [ ]:
umi_rel_max_hr_ant_media_pond = prop_pond(umi_rel_max_hr_ant, 'umi_rel_max_hr_ant')
umi_rel_max_hr_ant_media_pond

        umi_rel_max_hr_ant
0                59.000000
1                59.000000
2                57.000000
3                60.000000
4                63.000000
...                    ...
114235           38.860160
114236           39.000000
114237           44.433599
114238           53.853121
114239           55.566401

[114240 rows x 1 columns]

In [ ]:
contador = umi_rel_max_hr_ant_media_pond['umi_rel_max_hr_ant'].isna().sum()
contador

1134

In [ ]:
#Criação do dataframe da propriedade UMIDADE REL. MIN. NA HORA ANT. (AUT) (%)

umi_rel_min_hr_ant = []

umi_rel_min_hr_ant = df_prop_completo(umi_rel_min_hr_ant, 
                                      'UMIDADE REL. MIN. NA HORA ANT. (AUT) (%)')

umi_rel_min_hr_ant = umi_rel_min_hr_ant.replace([-9999], [np.nan])

umi_rel_min_hr_ant

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00   56.0          NaN         NaN
1       2007-07-21 01:00:00   57.0          NaN         NaN
2       2007-07-21 02:00:00   55.0          NaN         NaN
3       2007-07-21 03:00:00   55.0          NaN         NaN
4       2007-07-21 04:00:00   59.0          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00   37.0         35.0         NaN
114236  2020-07-31 20:00:00   37.0         35.0         NaN
114237  2020-07-31 21:00:00   39.0         39.0         NaN
114238  2020-07-31 22:00:00   47.0         43.0         NaN
114239  2020-07-31 23:00:00   48.0         52.0         NaN

[114240 rows x 4 columns]

In [ ]:
umi_rel_min_hr_ant_media_pond = prop_pond(umi_rel_min_hr_ant, 'umi_rel_min_hr_ant')
umi_rel_min_hr_ant_media_pond

        umi_rel_min_hr_ant
0                56.000000
1                57.000000
2                55.000000
3                55.000000
4                59.000000
...                    ...
114235           35.573440
114236           35.573440
114237           39.000000
114238           44.146879
114239           50.853121

[114240 rows x 1 columns]

In [ ]:
contador = umi_rel_min_hr_ant_media_pond['umi_rel_min_hr_ant'].isna().sum()
contador

1148

In [ ]:
#Criação do dataframe da propriedade UMIDADE RELATIVA DO AR, HORARIA (%)

umi_rel = []

umi_rel = df_prop_completo(umi_rel, 
                           'UMIDADE RELATIVA DO AR, HORARIA (%)')

umi_rel = umi_rel.replace([-9999], [np.nan])

umi_rel

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00   58.0          NaN         NaN
1       2007-07-21 01:00:00   57.0          NaN         NaN
2       2007-07-21 02:00:00   55.0          NaN         NaN
3       2007-07-21 03:00:00   59.0          NaN         NaN
4       2007-07-21 04:00:00   63.0          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00   39.0         35.0         NaN
114236  2020-07-31 20:00:00   39.0         39.0         NaN
114237  2020-07-31 21:00:00   48.0         43.0         NaN
114238  2020-07-31 22:00:00   48.0         55.0         NaN
114239  2020-07-31 23:00:00   52.0         57.0         NaN

[114240 rows x 4 columns]

In [ ]:
umi_rel_media_pond = prop_pond(umi_rel, 'umi_rel')
umi_rel_media_pond

          umi_rel
0       58.000000
1       57.000000
2       55.000000
3       59.000000
4       63.000000
...           ...
114235  36.146879
114236  39.000000
114237  44.433599
114238  52.992961
114239  55.566401

[114240 rows x 1 columns]

In [ ]:
contador = umi_rel_media_pond['umi_rel'].isna().sum()
contador

1132

In [ ]:
#Criação do dataframe da propriedade VENTO, DIREÇÃO HORARIA (gr) (° (gr))

dir_vent = []

dir_vent = df_prop_completo(dir_vent, 
                            'VENTO, DIREÇÃO HORARIA (gr) (° (gr))')

dir_vent = dir_vent.replace([-9999], [np.nan])

dir_vent

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00  124.0          NaN         NaN
1       2007-07-21 01:00:00  124.0          NaN         NaN
2       2007-07-21 02:00:00  110.0          NaN         NaN
3       2007-07-21 03:00:00  116.0          NaN         NaN
4       2007-07-21 04:00:00  130.0          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00  236.0        167.0         NaN
114236  2020-07-31 20:00:00  236.0        168.0         NaN
114237  2020-07-31 21:00:00  236.0        156.0         NaN
114238  2020-07-31 22:00:00  236.0        184.0         NaN
114239  2020-07-31 23:00:00  236.0        182.0         NaN

[114240 rows x 4 columns]

In [ ]:
dir_vent_media_pond = prop_pond(dir_vent, 'dir_vent')
dir_vent_media_pond

          dir_vent
0       124.000000
1       124.000000
2       110.000000
3       116.000000
4       130.000000
...            ...
114235  186.783670
114236  187.496950
114237  178.937589
114238  198.909433
114239  197.482872

[114240 rows x 1 columns]

In [ ]:
contador = dir_vent_media_pond['dir_vent'].isna().sum()
contador

1122

In [ ]:
#Criação do dataframe da propriedade VENTO, RAJADA MAXIMA (m/s)

raj_max_vent = []

raj_max_vent = df_prop_completo(raj_max_vent, 
                                'VENTO, RAJADA MAXIMA (m/s)')

raj_max_vent = raj_max_vent.replace([-9999], [np.nan])

raj_max_vent

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00   11.6          NaN         NaN
1       2007-07-21 01:00:00   10.9          NaN         NaN
2       2007-07-21 02:00:00   10.4          NaN         NaN
3       2007-07-21 03:00:00   11.8          NaN         NaN
4       2007-07-21 04:00:00    7.8          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00    9.2          8.7         NaN
114236  2020-07-31 20:00:00    7.8          7.9         NaN
114237  2020-07-31 21:00:00    8.1          6.1         NaN
114238  2020-07-31 22:00:00    6.4          3.7         NaN
114239  2020-07-31 23:00:00    6.9          2.8         NaN

[114240 rows x 4 columns]

In [ ]:
raj_max_vent_media_pond = prop_pond(raj_max_vent, 'raj_max_vent')
raj_max_vent_media_pond

        raj_max_vent
0          11.600000
1          10.900000
2          10.400000
3          11.800000
4           7.800000
...              ...
114235      8.843360
114236      7.871328
114237      6.673440
114238      4.474144
114239      3.975551

[114240 rows x 1 columns]

In [ ]:
contador = raj_max_vent_media_pond['raj_max_vent'].isna().sum()
contador

1143

In [ ]:
#Criação do dataframe da propriedade VENTO, VELOCIDADE HORARIA (m/s)

vel_vent = []

vel_vent = df_prop_completo(vel_vent, 
                            'VENTO, VELOCIDADE HORARIA (m/s)')

vel_vent = vel_vent.replace([-9999], [np.nan])

vel_vent

                       DATA  PATOS  SAO GONCALO  ITAPORANGA
0       2007-07-21 00:00:00    6.8          NaN         NaN
1       2007-07-21 01:00:00    6.5          NaN         NaN
2       2007-07-21 02:00:00    6.2          NaN         NaN
3       2007-07-21 03:00:00    5.1          NaN         NaN
4       2007-07-21 04:00:00    2.7          NaN         NaN
...                     ...    ...          ...         ...
114235  2020-07-31 19:00:00    3.1          3.3         NaN
114236  2020-07-31 20:00:00    4.4          2.8         NaN
114237  2020-07-31 21:00:00    1.3          2.0         NaN
114238  2020-07-31 22:00:00    0.0          1.0         NaN
114239  2020-07-31 23:00:00    0.0          1.5         NaN

[114240 rows x 4 columns]

In [ ]:
vel_vent_media_pond = prop_pond(vel_vent, 'vel_vent')
vel_vent_media_pond

        vel_vent
0       6.800000
1       6.500000
2       6.200000
3       5.100000
4       2.700000
...          ...
114235  3.242656
114236  3.258752
114237  1.799296
114238  0.713280
114239  1.069920

[114240 rows x 1 columns]

In [ ]:
contador = vel_vent_media_pond['vel_vent'].isna().sum()
contador

1122

In [ ]:
#Criação do dataframe com todas as médias ponderadas para todas as variáveis
medias_ponderadas = {}
medias_ponderadas = pd.DataFrame(medias_ponderadas)

medias_ponderadas['data']                  = patos['DATA']
medias_ponderadas['rad_glo']               = rad_glo_media_pond_corr_final['rad_glo']
medias_ponderadas['precip_tot']            = precip_tot_media_pond['precip_tot']
medias_ponderadas['pres_atm_niv_est']      = pres_atm_niv_est_media_pond['pres_atm_niv_est']
medias_ponderadas['pres_atm_max_hr_ant']   = pres_atm_max_hr_ant_media_pond['pres_atm_max_hr_ant']
medias_ponderadas['pres_atm_min_hr_ant']   = pres_atm_min_hr_ant_media_pond['pres_atm_min_hr_ant']
medias_ponderadas['temp_bulbo_seco']       = temp_bulbo_seco_media_pond['temp_bulbo_seco']
medias_ponderadas['temp_p_orv']            = temp_p_orv_media_pond['temp_p_orv']
medias_ponderadas['temp_max_hr_ant']       = temp_max_hr_ant_media_pond['temp_max_hr_ant']
medias_ponderadas['temp_min_hr_ant']       = temp_min_hr_ant_media_pond['temp_min_hr_ant']
medias_ponderadas['temp_p_orv_max_hr_ant'] = temp_p_orv_max_hr_ant_media_pond['temp_p_orv_max_hr_ant']
medias_ponderadas['temp_p_orv_min_hr_ant'] = temp_p_orv_min_hr_ant_media_pond['temp_p_orv_min_hr_ant']
medias_ponderadas['umi_rel_max_hr_ant']    = umi_rel_max_hr_ant_media_pond['umi_rel_max_hr_ant']
medias_ponderadas['umi_rel_min_hr_ant']    = umi_rel_min_hr_ant_media_pond['umi_rel_min_hr_ant']
medias_ponderadas['umi_rel']               = umi_rel_media_pond['umi_rel']
medias_ponderadas['dir_vent']              = dir_vent_media_pond['dir_vent']
medias_ponderadas['raj_max_vent']          = raj_max_vent_media_pond['raj_max_vent']
medias_ponderadas['vel_vent']              = vel_vent_media_pond['vel_vent']

medias_ponderadas = pd.DataFrame(medias_ponderadas)

medias_ponderadas

,data,rad_glo,precip_tot,pres_atm_niv_est,pres_atm_max_hr_ant,pres_atm_min_hr_ant,temp_bulbo_seco,temp_p_orv,temp_max_hr_ant,temp_min_hr_ant,temp_p_orv_max_hr_ant,temp_p_orv_min_hr_ant,umi_rel_max_hr_ant,umi_rel_min_hr_ant,umi_rel,dir_vent,raj_max_vent,vel_vent
0,2007-07-21 00:00:00,NaN,0.0,985.100000,985.100000,984.600000,25.000000,16.200000,26.600000,25.000000,17.300000,16.200000,59.000000,56.000000,58.000000,124.000000,11.600000,6.800000
1,2007-07-21 01:00:00,NaN,0.0,985.400000,985.400000,985.000000,24.600000,15.500000,25.000000,24.600000,16.200000,15.500000,59.000000,57.000000,57.000000,124.000000,10.900000,6.500000
2,2007-07-21 02:00:00,NaN,0.0,985.600000,985.700000,985.400000,24.300000,14.700000,24.600000,24.300000,15.500000,14.700000,57.000000,55.000000,55.000000,110.000000,10.400000,6.200000
3,2007-07-21 03:00:00,NaN,0.0,985.600000,985.800000,985.600000,23.600000,15.200000,24.400000,23.500000,15.300000,14.600000,60.000000,55.000000,59.000000,116.000000,11.800000,5.100000
4,2007-07-21 04:00:00,NaN,0.0,985.400000,985.700000,985.300000,22.900000,15.300000,23.600000,22.900000,15.400000,15.200000,63.000000,59.000000,63.000000,130.000000,7.800000,2.700000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
114235,2020-07-31 19:00:00,1533.570196,0.0,985.697184,985.797184,985.639840,30.843360,14.187424,31.458048,30.171328,14.858752,13.701408,38.860160,35.573440,36.146879,186.783670,8.843360,3.242656
114236,2020-07-31 20:00:00,800.952275,0.0,985.897184,985.897184,985.697184,30.300704,14.772032,31.000704,30.229376,14.944064,13.944064,39.000000,35.573440,39.000000,187.496950,7.871328,3.258752
114237,2020-07-31 21:00:00,101.179211,0.0,986.425856,986.425856,985.897184,28.470624,15.086720,30.300704,28.327968,15.186720,14.700704,44.433599,39.000000,44.433599,178.937589,6.673440,1.799296
114238,2020-07-31 22:00:00,NaN,0.0,987.083200,987.083200,986.425856,26.002112,15.542656,28.470624,25.887424,15.943360,14.872032,53.853121,44.146879,52.992961,198.909433,4.474144,0.713280
114239,2020-07-31 23:00:00,NaN,0.0,987.769216,987.769216,987.083200,25.758752,16.228672,26.644064,25.687424,16.228672,15.242656,55.566401,50.853121,55.566401,197.482872,3.975551,1.069920

In [ ]:
#Criando a conexão com o servidor (no caso, local).
conexao = pymysql.connect( host   = 'host',
                           user   = 'user',
                           passwd = 'password')

#Interador que permite navegar e modificar registros através dos databases.
cursor = conexao.cursor()

#Criação de uma database
cursor.execute( 'CREATE DATABASE IF NOT EXISTS dataset_unico' )

1

In [ ]:
#Verificando se a database foi criada
cursor.execute( 'SHOW DATABASES' )

for x in cursor:
    print( x )

('dataset_unico',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [ ]:
#Criação de uma tabela na database a partir de um arquivo pandas (DataFrame)

#Estabelecendo a conexão com o servidor e com a database nele inserido 
conexao = pymysql.connect( host     = 'host',
                           user     = 'user',
                           passwd   = 'password',
                           database = 'database')

#Função 'create_engine' inicializa a conxexão com a database
engine = create_engine('mysql+pymysql://user:password@host:port/database')

medias_ponderadas.to_sql('medias_ponderadas', engine, if_exists = 'replace', index = True)

In [ ]:
#Criação de um gráfico interativo para ter uma melhor visualização dos dados

#Criação de um gráfico de dispersão ligados por linha
ponderada = go.Scatter(x = medias_ponderadas['data'].iloc[163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 : 163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24],                             
                       y = medias_ponderadas['rad_glo'].iloc[163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 : 163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24], 
                       mode = 'markers + lines',                               
                       name = 'PONDERADA',                                         
                       line = {'color' : '#fffd01'})                      

#Criação de um gráfico de dispersão ligados por linha
interpolado = go.Scatter(x = medias_ponderadas['data'].iloc[163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 : 163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24],                              
                         y = media_aritm['RADIACAO GLOBAL (kJ/m²)'].iloc[163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 : 163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24], 
                         mode = 'markers + lines',                               
                         name = 'ARITMÉTICA',                                           
                         line = {'color' : '#01ff07'})   

#Criação de um gráfico de dispersão ligados por linha
patos_plot = go.Scatter(x = media_pond_corr_final['DATA'].iloc[163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 : 163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24],                              
                        y = rad_glo['PATOS'].iloc[163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 : 163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24], 
                        mode = 'markers + lines',                               
                        name = 'PATOS',                                           
                        line = {'color' : '#f97306'}) 

#Criação de um gráfico de dispersão ligados por linha
saogoncalo_plot = go.Scatter(x = media_pond_corr_final['DATA'].iloc[163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 : 163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24],                              
                             y = rad_glo['SAO GONCALO'].iloc[163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 : 163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24], 
                             mode = 'markers + lines',                               
                             name = 'SÃO GONÇALO',                                           
                             line = {'color' : '#0343df'})  

#Criação de um gráfico de dispersão ligados por linha
itaporanga_plot = go.Scatter(x = media_pond_corr_final['DATA'].iloc[163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 : 163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24],                              
                             y = rad_glo['ITAPORANGA'].iloc[163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 : 163*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24 + 366*24 + 365*24 + 365*24 + 365*24], 
                             mode = 'markers + lines',                               
                             name = 'ITAPORANGA',                                           
                             line = {'color' : '#e50000'})   

#Definição do layout do gráfico
layout = go.Layout(title = '<b>Radiação global em kJ/m²</b>',
                   titlefont = {'family': 'Arial', 'size': 20})         

#Criação de uma lista a partir dos gráficos de dispersão para que o plotly consigo gerar o gráfico
figprop = [ponderada, interpolado, patos_plot, saogoncalo_plot, itaporanga_plot]

#Criação da figura a partir dos gráficos e do layout
fig = go.Figure(figprop, layout)

#Exibição da figura
fig.show(renderer = 'browser')

In [ ]:
it_est = go.Scattermapbox(name = 'Itaporanga - Estação',
                          visible = True,
                          showlegend = True,
                          lat = ['-7.318611'],
                          lon = ['-38.140833'],
                          marker = go.scattermapbox.Marker(size = 14, color = 'sienna'),
                          mode = 'markers',
                          text = 'Estação',
                          textposition = 'bottom center',)

sg_est = go.Scattermapbox(name = 'São Gonçalo - Estação',
                          visible = True,
                          showlegend = True,
                          lat = ['-6.756667'],
                          lon = ['-38.227500'],
                          marker = go.scattermapbox.Marker(size = 14, color = 'deeppink'),
                          mode = 'markers',
                          text = 'Estação',
                          textposition = 'bottom center',)

pt_est = go.Scattermapbox(name = 'Patos - Estação',
                          visible = True,
                          showlegend = True,
                          lat = ['-7.079722'],
                          lon = ['-37.272500'],
                          marker = go.scattermapbox.Marker(size = 14, color = 'orange'),
                          mode = 'markers',
                          text = 'Estação',
                          textposition = 'bottom center',)

ufv = go.Scattermapbox(name = 'Coremas - UFV',
                       visible = True,
                       showlegend = True,
                       lat = ['-6.963257'],
                       lon = ['-37.999128'],
                       marker = go.scattermapbox.Marker(symbol = 'circle',
                                                        size = 22,
                                                        color = 'black'),
                       mode = 'markers',
                       text = 'UFV',
                       textposition = 'bottom center',)

cor_ma = go.Scattermapbox(name = 'Coremas - MA',
                          visible = True,
                          showlegend = True,
                          lat = ['-7.051667'],
                          lon = ['-37.880278'],
                          marker = go.scattermapbox.Marker(size = 14, color = 'green'),
                          mode = 'markers',
                          text = 'Média Aritmética',
                          textposition = 'bottom center',)

cor_mp = go.Scattermapbox(name = 'Coremas - MP',
                          visible = True,
                          showlegend = True,
                          lat = ['-6.9632570000000005'],
                          lon = ['-37.999128'],
                          marker = go.scattermapbox.Marker(size = 14, color = 'yellow'),
                          mode = 'markers',
                          text = 'Média Ponderada',
                          textposition = 'bottom center',)

pre_fig = [it_est, sg_est, pt_est, ufv, cor_ma, cor_mp]

fig = go.Figure(pre_fig)

fig.update_layout(title = '<b>Localizações das medidas e do complexo solar</b>',
                  titlefont = {'family': 'Arial', 'size': 20},
                  autosize = True,
                  hovermode = 'closest',
                  mapbox = dict(accesstoken = 'pk.eyJ1IjoiYmFzaWxpb2d1c3Rhdm8iLCJhIjoiY2tnYjVuNXEwMGRwMDJydGpsMnI3MmxkZyJ9.i6vjkiOoF5aZYfkzLCF8Pg',
                                bearing = 0,
                                center = dict(lat = -7.014390,
                                              lon = -37.945790),
                                              pitch = 0,
                                              zoom = 9,
                                              style = 'outdoors'),)

fig.update_layout(legend = dict(yanchor = "top",
                                y = 0.99,
                                xanchor = "left",
                                x = 0.01,
                                bordercolor = "Black",
                                borderwidth = 2,
                                title_font_family = "Arial",
                                font = dict(family = "Arial",
                                            size = 14,
                                            color = "black") ) )

fig.show(renderer = 'browser')

time: 3.08 s